farmertan81/Spot-Welder/STM32G474CE/src/main.c
#define V_CAP_DIVIDER 6.0f

/* ============ INA226 Addresses ============ */
#define INA226_ADDR_PACK 0x40
#define INA226_ADDR_NODE1 0x41
#define INA226_ADDR_NODE2 0x44

/* ============ INA226 Registers ============ */
#define INA226_REG_CONFIG 0x00
#define INA226_REG_SHUNT_V 0x01
#define INA226_REG_BUS_V 0x02
#define INA226_REG_CALIBRATION 0x05

/* ============ INA226 Shunt Resistor ============ */
#define INA226_SHUNT_R 0.0002f /* 200 µΩ */
/* Rev1 charge current correction factor (matches ESP32 value) */
#define CHARGE_CURRENT_CORRECTION 1.0f

/* ============ Charger Thresholds (INA226 ONLY) ============ */
#define CHG_VPACK_ON 8.7f   /* Turn charger ON below this */
#define CHG_VPACK_OFF 9.11f /* Turn charger OFF at/above this */

/* ============ INA226 Scaling ============ */
// Calibrated 2025-05-08 using Fluke 87V multimeter
// Actual: vlow=2.904V, vmid=5.805V, vpack=8.71V
#define V_NODE1_SCALE 1.001327f  // Was: 0.9965f
#define V_NODE2_SCALE 0.986048f  // Was: 0.9835f
#define VPACK_SCALE   1.001149f  // Calibrated 2025-05-08: 8.71V (Fluke 87V)

/* ============ Limits / Timing ============ */
static const uint32_t WELD_COOLDOWN_MS = 500;
static const uint16_t MAX_WELD_MS = 200;
static const uint32_t PEDAL_DEBOUNCE_MS = 40;
static const uint32_t BOOT_INHIBIT_MS = 5000;
static const uint32_t ARM_TIMEOUT_MS = 0;
static const uint32_t READY_TIMEOUT_MS = 1500;
static const float CONTACT_THRESHOLD_V_DEFAULT = 1.5f;
static const uint32_t CONTACT_SAMPLE_MS = 10;
static const uint32_t CONTACT_DEBOUNCE_MS = 50;

/* Phase-start alignment thresholds.
 * Use waveform current itself (not command time) to mark phase start at the
 * first meaningful conduction sample. */
static const float PHASE_START_MIN_CURRENT_A = 50.0f;
static const float PHASE_START_PEAK_RATIO = 0.10f;

/* UART TX pacing for long WAVEFORM lines.
 * 1024 bytes @2Mbps is ~4ms on wire, so 250ms timeout is generous. */
static const uint32_t UART_TX_CHUNK_SIZE = 1024U;
static const uint32_t UART_TX_TIMEOUT_MS = 250U;

/* ============ PWM Settings ============ */
static const uint16_t PWM_MAX = 1023;
static const uint16_t TIM1_PSC = 0;
static const uint32_t TIM1_ARR = 16999;

#if (SystemCoreClock != 170000000)
#warning "TIM2 PSC assumes 170MHz clock. Verify timing!"
#endif

/* ============ HAL handles ============ */
UART_HandleTypeDef huart1;
TIM_HandleTypeDef htim1;
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
I2C_HandleTypeDef hi2c1;
IWDG_HandleTypeDef hiwdg;

/* ==== VDDA Calibration ==== */
/* STM32G474: Factory VREFINT cal was measured at VDDA = 3.0V (3000 mV).
 * The HAL/LL headers may define VREFINT_CAL_VREF (in mV) and VREFINT_CAL_ADDR.
 * We use our own names to avoid redefinition warnings/errors. */
#define VREFINT_CAL_MV 3000UL /* Calibration VDDA in millivolts */
#define VREFINT_CAL_PTR \
    ((volatile uint16_t*)0x1FFF75AAUL) /* Factory cal value address    */
static float measured_vdda = 3.3f; /* Updated periodically by measureVDDA() */

/* ============ Weld Params (defaults) ============ */
static volatile uint8_t weld_mode = 1;
static volatile uint16_t weld_d1_ms = 10;
static volatile uint16_t weld_gap1_ms = 0;
static volatile uint16_t weld_d2_ms = 0;
static volatile uint16_t weld_gap2_ms = 0;
static volatile uint16_t weld_d3_ms = 0;

static volatile uint8_t weld_power_pct = 100;
static volatile bool preheat_enabled = false;
static volatile uint16_t preheat_ms = 20;
static volatile uint8_t preheat_pct = 30;
static volatile uint16_t preheat_gap_ms = 3;

/* ============ Control mode (persisted from Flash) ============ */
uint8_t control_mode = 0; /* 0=time, 1=joule */

/* Joule settings (persisted from Flash) */
float joule_target_j = 50.0f;
uint32_t joule_max_ms = 40;
float joule_min_current_a = 0.5f;

/* Runtime Joule tracking
 * joule_accumulated is workpiece energy (lead-compensated) used for control. */
float joule_accumulated = 0.0f;           /* Workpiece Joules */
float joule_total_accumulated = 0.0f;     /* Total Joules from caps (V*I*dt) */
float joule_lead_loss_accumulated = 0.0f; /* Estimated lead losses (I^2*R*dt) */
bool joule_target_reached = false;
bool joule_timeout_abort = false;
bool joule_bad_contact_abort = false;
uint32_t joule_actual_duration_us = 0;

/* ============ Trigger Settings ============ */
static volatile uint8_t trigger_mode = 1;        // 1 = pedal, 2 = contact
static volatile uint8_t contact_hold_steps = 2;  // each step = 500 ms
static volatile uint8_t contact_with_pedal =
    1;  // 1 = require contact in pedal mode (safe default)

/* ============ State ============ */
static volatile bool welding_now = false;
static uint32_t last_weld_ms = 0;

static bool armed = false;
static uint32_t armed_until_ms = 0;
static uint32_t boot_ms = 0;

static bool system_ready = false;
static uint32_t ready_until_ms = 0;

static GPIO_PinState pedal_last_raw = GPIO_PIN_SET;
static GPIO_PinState pedal_stable = GPIO_PIN_SET;
static uint32_t pedal_last_change_ms = 0;

static float temp_filtered_c = 25.0f;
static float current_peak_amps = 0.0f;  // Track peak of recipe

/* Added calibration capture values */
static float cal_vcap_before = 0.0f;
static float cal_vcap_after = 0.0f;
static uint32_t cal_adc_peak_raw = 0;
static float cal_current_avg = 0.0f;

/* Configurable lead resistance (default 1.1 mΩ).
 * Measured: 0.54 mΩ + 0.57 mΩ = 1.1 mΩ total (4-wire Kelvin test).
 * 41% improvement over previous leads (1.87 mΩ → 1.1 mΩ). */
static float lead_resistance_ohms = 0.0011f;  // 1.1 mΩ measured
static PersistentSettings g_persistent_settings = {0};
static const float LEAD_RESISTANCE_MIN_OHMS = 0.0001f; /* 0.1 mΩ */
static const float LEAD_RESISTANCE_MAX_OHMS = 0.0100f; /* 10.0 mΩ */

/* ============ Waveform Capture (Phase 3) ============ */
#define WAVEFORM_BUFFER_SIZE 4096
#define WAVEFORM_CHUNK_SAMPLES 100U
#define WAVEFORM_LINE_BUFFER_SIZE (WAVEFORM_CHUNK_SAMPLES * 18 + 256)
#define WAVEFORM_SAMPLE_INTERVAL_US 100U
/*
 * Gap timing compensation: scope-measured overhead from preheat-FET-off
 * to gap-timer-start plus gap-timer-end to main-FET-on.  This fixed cost
 * comes from waveform bookkeeping, timestamp capture, and function call
 * overhead.  Empirically measured at ~90µs via oscilloscope.
 *
 * Adjust this value if you change compiler optimization level or modify
 * the fireRecipe() gap bookkeeping code.
 */
#define GAP_TIMING_COMPENSATION_US 150U
#define PWM_PERIOD_US 100U
#define WAVEFORM_PWM_PHASE_SWEEP_STEP_US 12U
#define WAVEFORM_PWM_PHASE_SWEEP_SAMPLES 6U
#define WAVEFORM_PRE_SAMPLES 10U  /* 1ms pre-buffer */
#define WAVEFORM_POST_SAMPLES 10U /* 1ms post-buffer */
#define WAVEFORM_MAX_PULSE_MS 100U
#define WAVEFORM_MAX_ACTIVE_SAMPLES \
    ((WAVEFORM_MAX_PULSE_MS * 1000U) / WAVEFORM_SAMPLE_INTERVAL_US)

/* Temporary ADC debug switch:
 * 1 = re-apply ADC channel config inside adcReadFastCurrentPair() for A/B
 * check. 0 = rely only on pre-config from adcPrepareFastCurrentChannels(). */
#define ADC_DEBUG_USE_OLD_CONFIG 0
#define ADC_PAIR_VERBOSE_DEBUG 0  // Set to 1 only for debugging ADC reads

#define ADC_FAST_CURRENT_P_CHANNEL ADC_CHANNEL_2
#define ADC_FAST_CURRENT_N_CHANNEL ADC_CHANNEL_3

/* Capture capacity supports up to 1ms pre + 100ms pulse + 1ms post = 1020
 * samples. Keep a larger ring (4096) for debug headroom and future longer
 * windows. */
_Static_assert(WAVEFORM_BUFFER_SIZE >=
                   (WAVEFORM_PRE_SAMPLES + WAVEFORM_MAX_ACTIVE_SAMPLES +
                    WAVEFORM_POST_SAMPLES),
               "WAVEFORM_BUFFER_SIZE too small for 100ms capture window");

/* Safety check: each sample adds ~14 chars (",AAAA.AA,VV.VV") to WAVEFORM line.
 */
_Static_assert(
    WAVEFORM_BUFFER_SIZE <= 4096,
    "Unexpected waveform buffer growth; re-check RAM/UART line budget");
_Static_assert(WAVEFORM_LINE_BUFFER_SIZE >= (WAVEFORM_CHUNK_SAMPLES * 18 + 256),
               "WAVEFORM_LINE_BUFFER_SIZE too small for waveform CSV payload");

