farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* SAFETY: INA226 failure → charger OFF */
    if (!ina226_ok) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* DISARMED → charger OFF */
    if (!armed) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* WELDING → charger OFF */
    if (welding_now) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* NORMAL HYSTERESIS CONTROL */
    if (ina_vpack >= CHG_VPACK_OFF) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
    } else if (ina_vpack <= CHG_VPACK_ON) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_SET);
        charger_enabled = true;
    }
}

/* ============ UART Status Packets (split into two for ESP32 parsing)
 * ============ */

static void sendStatusPacket(void) {
    char buf[512];

    /* --- Packet 1: STATUS (system state + full runtime recipe/settings) --- */
    float vcap = readCapVoltage();
    float power_f = (float)weld_power_pct;

    if (control_mode == 1U) {
        const char* joule_status = "RUNNING";
        if (joule_target_reached) {
            joule_status = "OK";
        } else if (joule_timeout_abort) {
            joule_status = "TIMEOUT";
        } else if (joule_bad_contact_abort) {
            joule_status = "BAD_CONTACT";
        }

        /* joule_actual is workpiece energy (lead-compensated control variable).
         * Debug fields show total source energy and estimated lead-loss energy.
         */
        snprintf(buf, sizeof(buf),
                 "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
                 "temp=%.2f,mode=%d,d1=%u,gap1=%u,d2=%u,gap2=%u,d3=%u,"
                 "power=%.2f,preheat_en=%d,preheat_ms=%u,preheat_pct=%u,"
                 "preheat_gap_ms=%u,trigger_mode=%u,contact_hold_steps=%u,"
                 "contact_with_pedal=%u,vdda=%.3f,lead_r_ohm=%.6f,"
                 "control_mode=%u,joule_target_j=%.1f,joule_target=%.1f,joule_"
                 "actual=%.1f,"
                 "joule_total=%.1f,joule_lead_loss=%.1f,"
                 "joule_duration_ms=%lu,joule_status=%s",
                 armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
                 temp_filtered_c, (int)weld_mode, (unsigned)weld_d1_ms,
                 (unsigned)weld_gap1_ms, (unsigned)weld_d2_ms,
                 (unsigned)weld_gap2_ms, (unsigned)weld_d3_ms, power_f,
                 preheat_enabled ? 1 : 0, (unsigned)preheat_ms,
                 (unsigned)preheat_pct, (unsigned)preheat_gap_ms,
                 (unsigned)trigger_mode, (unsigned)contact_hold_steps,
                 (unsigned)contact_with_pedal, measured_vdda,
                 lead_resistance_ohms, (unsigned)control_mode, joule_target_j,
                 joule_target_j, joule_accumulated, joule_total_accumulated,
                 joule_lead_loss_accumulated,
                 (unsigned long)(joule_actual_duration_us / 1000U),
                 joule_status);
    } else {
        snprintf(buf, sizeof(buf),
                 "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
                 "temp=%.2f,mode=%d,d1=%u,gap1=%u,d2=%u,gap2=%u,d3=%u,"
                 "power=%.2f,preheat_en=%d,preheat_ms=%u,preheat_pct=%u,"
                 "preheat_gap_ms=%u,trigger_mode=%u,contact_hold_steps=%u,"
                 "contact_with_pedal=%u,vdda=%.3f,lead_r_ohm=%.6f,"
                 "control_mode=%u,joule_target_j=%.1f",
                 armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
                 temp_filtered_c, (int)weld_mode, (unsigned)weld_d1_ms,
                 (unsigned)weld_gap1_ms, (unsigned)weld_d2_ms,
                 (unsigned)weld_gap2_ms, (unsigned)weld_d3_ms, power_f,
                 preheat_enabled ? 1 : 0, (unsigned)preheat_ms,
                 (unsigned)preheat_pct, (unsigned)preheat_gap_ms,
                 (unsigned)trigger_mode, (unsigned)contact_hold_steps,
                 (unsigned)contact_with_pedal, measured_vdda,
                 lead_resistance_ohms, (unsigned)control_mode, joule_target_j);
    }
    uartSend(buf);

    /* --- Packet 2: STATUS2 (INA226 telemetry) --- */
    snprintf(buf, sizeof(buf),
             "STATUS2,ina_ok=%d,chg_en=%d,vpack=%.2f,vlow=%.2f,"
             "vmid=%.2f,cell1=%.2f,cell2=%.2f,cell3=%.2f,ichg=%.2f",
             ina226_ok ? 1 : 0, charger_enabled ? 1 : 0, ina_vpack, vlow, vmid,
             ina_cell1, ina_cell2, ina_cell3, ina_ichg);
    uartSend(buf);
}

/* ============ Shunt Sensing Functions ============ */
static uint32_t adcReadSingleConfigured(ADC_HandleTypeDef* hadc,
                                        uint32_t timeout_ms) {
    HAL_ADC_Start(hadc);
    if (HAL_ADC_PollForConversion(hadc, timeout_ms) != HAL_OK) {
        HAL_ADC_Stop(hadc);
        return 0xFFFF;
    }

    uint32_t val = HAL_ADC_GetValue(hadc);
    HAL_ADC_Stop(hadc);
    return val;
}

static uint32_t adcReadChannelWithTiming(ADC_HandleTypeDef* hadc,
                                         uint32_t channel,
                                         uint32_t sampling_time,
                                         uint32_t timeout_ms) {
    if (hadc == &hadc1 && adc1_fast_current_mode) {
        HAL_ADC_Stop(&hadc1);
        hadc1.Init.ScanConvMode = ADC_SCAN_DISABLE;
        hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
        hadc1.Init.NbrOfConversion = 1;
        if (HAL_ADC_Init(&hadc1) != HAL_OK) {
            return 0xFFFF;
        }
        adc1_fast_current_mode = false;
    }

    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = sampling_time;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;

    if (HAL_ADC_ConfigChannel(hadc, &sConfig) != HAL_OK) {
        return 0xFFFF;
    }

