farmertan81/Spot-Welder/STM32G474CE/src/main.c
    return true;
}

static uint32_t adcReadFastVcapN(void) {
    if (hadc2.Instance->CR & ADC_CR_ADSTART) {
        hadc2.Instance->CR |= ADC_CR_ADSTP;
        uint32_t t = 10000U;
        while (hadc2.Instance->CR & ADC_CR_ADSTP) {
            if (--t == 0U) return 0U;
        }
    }
    hadc2.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;
    hadc2.Instance->CR |= ADC_CR_ADSTART;
    uint32_t t = 100000U;
    while (!(hadc2.Instance->ISR & ADC_ISR_EOC)) {
        if (--t == 0U) return 0U;
    }
    return hadc2.Instance->DR;
}

/* Fast-path weld current + Vcap+ read using register-level ADC access. */
static bool adcReadFastTriplet(uint32_t* out_p, uint32_t* out_n,
                               uint32_t* out_vp) {
    if (!out_p || !out_n || !out_vp) {
        return false;
    }

    *out_p = 0U;
    *out_n = 0U;
    *out_vp = 0U;

    if (!adc1_fast_current_mode) {
        return false;
    }

    if (hadc1.Instance->CR & ADC_CR_ADSTART) {
        hadc1.Instance->CR |= ADC_CR_ADSTP;
        uint32_t stop_timeout = 100000U;
        while (hadc1.Instance->CR & ADC_CR_ADSTP) {
            if (--stop_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADSTP_TIMEOUT");
#endif
                return false;
            }
        }
    }

    if (!(hadc1.Instance->CR & ADC_CR_ADEN)) {
        hadc1.Instance->CR |= ADC_CR_ADEN;
        uint32_t ready_timeout = 100000U;
        while (!(hadc1.Instance->ISR & ADC_ISR_ADRDY)) {
            if (--ready_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADRDY_TIMEOUT");
#endif
                return false;
            }
        }
    }

    hadc1.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;
    hadc1.Instance->CR |= ADC_CR_ADSTART;

    uint32_t timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
#if ADC_PAIR_VERBOSE_DEBUG
            uartSend("DBG,REG_POLL1_TIMEOUT");
#endif
            return false;
        }
    }
    *out_p = hadc1.Instance->DR;

    timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
            return false;
        }
    }
    *out_n = hadc1.Instance->DR;

    timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
            return false;
        }
    }
    *out_vp = hadc1.Instance->DR;

    hadc1.Instance->CR |= ADC_CR_ADSTP;
    timeout = 100000U;
    while (hadc1.Instance->CR & ADC_CR_ADSTP) {
        if (--timeout == 0U) {
            break;
        }
    }

    return true;
}

static void capturePulseAmpsForDurationUs(uint32_t pulse_duration_us,
                                          uint16_t duty) {
    uint32_t peak_raw = 0;
    float peak_current = 0.0f;
    float sum_current = 0.0f;
    uint32_t sample_count = 0;

    if (pulse_duration_us == 0U) {
        cal_adc_peak_raw = 0U;
        cal_current_avg = 0.0f;
        return;
    }

    const float v_per_count = measured_vdda / 4095.0f;

    /*
     * IMPORTANT (preheat fix): when PWM duty < 100%, sampling exactly every
     * 100us can phase-lock to TIM1's 100us period and repeatedly hit OFF time,
     * producing false near-zero current during preheat. Sweep several ADC reads
     * across each 100us sample slot and keep the max to reliably capture
     * ON-time current.
     */
    const bool pulse_uses_pwm_window =
        (duty > 0U) && (duty < PWM_MAX) &&
        (WAVEFORM_SAMPLE_INTERVAL_US == PWM_PERIOD_US);

    uint32_t pulse_start_us = micros_now();
    uint32_t pulse_end_estimate_us = pulse_start_us + pulse_duration_us;
    uint32_t next_sample_us = pulse_start_us;

    const bool joule_mode_active = (control_mode == 1U);
    const uint32_t joule_bad_contact_limit_us = 5000U;
    uint32_t joule_low_current_streak_us = 0U;
    uint32_t joule_duration_offset_us = joule_actual_duration_us;
    uint32_t joule_last_sample_elapsed_us = 0U;

    /*
     * ── BRICK SHITHOUSE TIMING ──────────────────────────────────────────
     *
     * TIM2 is ALREADY RUNNING — started by doPulseMsPwm() back-to-back
     * with pwmOnDuty() so scope-measured pulse width matches config.
     *
     * The ISR (TIM2_IRQHandler) will fire when TIM2 overflows and call
     * pwmOff() within ~70 ns.  This loop just samples ADC until the ISR
     * sets tim2_fet_killed.
     *
     * If called from a context where TIM2 was NOT pre-started (safety),
     * tim2_fet_killed will already be false and the loop works normally
     * — it just won't have the tight timing guarantee.
     * ────────────────────────────────────────────────────────────────────
     */

    /* ── Sampling loop ─────────────────────────────────────────────────
     * We sample ADC while the FET is on.  When TIM2 expires the ISR
     * kills the FET and sets tim2_fet_killed; the loop exits cleanly.
     * No SR polling for pwmOff timing – that is 100 % hardware now.
     * ─────────────────────────────────────────────────────────────────
     */
    while (!tim2_fet_killed) {
        uint32_t now_us = micros_now();
        if ((int32_t)(now_us - next_sample_us) < 0) {
            continue;
        }

        int32_t diff = 0;
        float amps = 0.0f;
        float v_cap_live = cached_vcap;
        uint32_t sample_capture_us = now_us;

        if (pulse_uses_pwm_window) {
            int32_t best_diff = 0;
            float best_amps = 0.0f;
            float best_v_cap_live = cached_vcap;
            uint32_t best_sample_us = now_us;
            uint32_t slot_anchor_us = next_sample_us;
            bool have_sweep_sample = false;

            for (uint16_t sweep_i = 0;
                 sweep_i < WAVEFORM_PWM_PHASE_SWEEP_SAMPLES; sweep_i++) {
                if (tim2_fet_killed) break;

                uint32_t target_us =
                    slot_anchor_us +
                    ((uint32_t)sweep_i * WAVEFORM_PWM_PHASE_SWEEP_STEP_US);
                if ((int32_t)(target_us - pulse_end_estimate_us) >= 0) {
                    break;
                }

