farmertan81/Spot-Welder/STM32G474CE/src/main.c
        if (!preheat_enabled || preheat_ms == 0U || preheat_gap_ms == 0U) {
            gap_start_rel = 0U;
            gap_end_rel = 0U;
        }

        char phases_line[220];
        int phases_n = snprintf(
            phases_line, sizeof(phases_line),
            "WAVEFORM_PHASES,preheat_start=%lu,preheat_end=%lu,gap_start=%lu,"
            "gap_end=%lu,main_start=%lu,main_end=%lu",
            (unsigned long)preheat_start_rel, (unsigned long)preheat_end_rel,
            (unsigned long)gap_start_rel, (unsigned long)gap_end_rel,
            (unsigned long)main_start_rel, (unsigned long)main_end_rel);
        if (phases_n > 0 && phases_n < (int)sizeof(phases_line)) {
            uartSend(phases_line);
        }
    }

#if ADC_PAIR_VERBOSE_DEBUG
    char dbg[96];
    snprintf(
        dbg, sizeof(dbg),
        "DBG,WAVEFORM_TX,count=%u,chunks=%u,chunk_size=%u,format=CHUNKED_TVI",
        (unsigned int)waveform_index,
        (unsigned int)((waveform_index + WAVEFORM_CHUNK_SAMPLES - 1U) /
                       WAVEFORM_CHUNK_SAMPLES),
        (unsigned int)WAVEFORM_CHUNK_SAMPLES);
    uartSend(dbg);
#endif
}

static uint16_t get_planned_active_pulse_ms(void) {
    uint32_t active_ms = 0U;

    /* FINDING: preheat path uses the same TIM1 PWM pulse engine (doPulseMsPwm)
     * as the main weld pulse; it is not simple GPIO on/off toggling. */
    if (preheat_enabled && preheat_ms > 0U) {
        active_ms += preheat_ms;

        /* Preheat OFF gap is now waveform-captured to make the drop visible. */
        if (weld_mode >= 1U && preheat_gap_ms > 0U) {
            active_ms += preheat_gap_ms;
        }
    }

    if (weld_mode >= 1U) {
        active_ms += weld_d1_ms;
    }
    if (weld_mode >= 2U) {
        active_ms += weld_gap1_ms;
        active_ms += weld_d2_ms;
    }
    if (weld_mode >= 3U) {
        active_ms += weld_gap2_ms;
        active_ms += weld_d3_ms;
    }

    if (active_ms > WAVEFORM_MAX_PULSE_MS) {
        active_ms = WAVEFORM_MAX_PULSE_MS;
    }

    return (uint16_t)active_ms;
}

/* ============ Helpers ============ */
static void uartSend(const char* s) {
    if (s == NULL) {
        return;
    }

    const uint8_t* msg = (const uint8_t*)s;
    size_t remaining = strlen(s);

    while (remaining > 0U) {
        uint16_t chunk = (remaining > UART_TX_CHUNK_SIZE)
                             ? (uint16_t)UART_TX_CHUNK_SIZE
                             : (uint16_t)remaining;

        HAL_StatusTypeDef st = HAL_UART_Transmit(&huart1, (uint8_t*)msg, chunk,
                                                 UART_TX_TIMEOUT_MS);
        if (st != HAL_OK) {
            break;
        }

        msg += chunk;
        remaining -= chunk;

        if (remaining > 0U) {
            HAL_Delay(1);
        }
    }

    static const uint8_t crlf[2] = {'\r', '\n'};
    (void)HAL_UART_Transmit(&huart1, (uint8_t*)crlf, 2U, UART_TX_TIMEOUT_MS);
}

static inline void pwmOff(void) {
    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, 0);
}

static inline void pwmOnDuty(uint16_t duty) {
    if (duty > PWM_MAX) duty = PWM_MAX;

    uint32_t ccr =
        ((uint32_t)duty * (uint32_t)(TIM1_ARR + 1U)) / (uint32_t)(PWM_MAX + 1U);
    if (ccr > TIM1_ARR) ccr = TIM1_ARR;

    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, ccr);
}

static bool contactDetectedRaw(float* out_vcap) {
    float vcap = readCapVoltage();
    if (out_vcap != NULL) {
        *out_vcap = vcap;
    }

    return (vcap > g_contact_threshold_v);
}

static bool contactDetected(void) {
    uint32_t now = HAL_GetTick();

    if ((now - g_contact_last_sample_ms) < CONTACT_SAMPLE_MS) {
        return g_contact_state;
    }
    g_contact_last_sample_ms = now;

    bool current_raw = contactDetectedRaw(&g_contact_last_vcap);

    if (!current_raw) {
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        return g_contact_state;
    }

    if (g_contact_state) {
        return true;
    }

    if (!g_contact_pending_high) {
        g_contact_pending_high = true;
        g_contact_pending_since_ms = now;
        return false;
    }

    if ((now - g_contact_pending_since_ms) >= CONTACT_DEBOUNCE_MS) {
        g_contact_state = true;
    }

    return g_contact_state;
}

static void persistent_defaults(PersistentSettings* out) {
    if (!out) return;
    memset(out, 0, sizeof(*out));
    out->lead_resistance_ohms = 0.0011f;
    out->pulse_mode = 1;
    out->pulse_d1_ms = 10;
    out->pulse_gap1_ms = 0;
    out->pulse_d2_ms = 0;
    out->pulse_gap2_ms = 0;
    out->pulse_d3_ms = 0;
    out->power_pct = 100;
    out->trigger_mode = 1;
    out->contact_hold_steps = 2;
    out->contact_with_pedal = 1;
    out->preheat_en = 0;
    out->preheat_ms = 20;
    out->preheat_pct = 30;
    out->preheat_gap_ms = 3;
    out->control_mode = 0;
    out->joule_target_j = 50.0f;
}

static void persistent_from_runtime(PersistentSettings* out) {
    if (!out) return;
    out->lead_resistance_ohms = lead_resistance_ohms;
    out->pulse_mode = weld_mode;
    out->pulse_d1_ms = weld_d1_ms;
    out->pulse_gap1_ms = weld_gap1_ms;
    out->pulse_d2_ms = weld_d2_ms;
    out->pulse_gap2_ms = weld_gap2_ms;
    out->pulse_d3_ms = weld_d3_ms;
    out->power_pct = weld_power_pct;
    out->trigger_mode = trigger_mode;
    out->contact_hold_steps = contact_hold_steps;
    out->contact_with_pedal = contact_with_pedal;
    out->preheat_en = preheat_enabled ? 1U : 0U;
    out->preheat_ms = preheat_ms;
    out->preheat_pct = preheat_pct;
    out->preheat_gap_ms = preheat_gap_ms;
    out->control_mode = control_mode;
    out->joule_target_j = joule_target_j;
}

static void apply_loaded_settings(const PersistentSettings* in) {
    if (!in) return;

    lead_resistance_ohms = in->lead_resistance_ohms;
    weld_mode = in->pulse_mode;
    weld_d1_ms = in->pulse_d1_ms;
    weld_gap1_ms = in->pulse_gap1_ms;
    weld_d2_ms = in->pulse_d2_ms;
    weld_gap2_ms = in->pulse_gap2_ms;
    weld_d3_ms = in->pulse_d3_ms;
    weld_power_pct = in->power_pct;
    trigger_mode = in->trigger_mode;
    contact_hold_steps = in->contact_hold_steps;
    contact_with_pedal = in->contact_with_pedal;
    preheat_enabled = (in->preheat_en != 0U);
    preheat_ms = in->preheat_ms;
    preheat_pct = in->preheat_pct;
    preheat_gap_ms = in->preheat_gap_ms;
    control_mode = in->control_mode;
    joule_target_j = in->joule_target_j;

    clampParams();

    if (lead_resistance_ohms < LEAD_RESISTANCE_MIN_OHMS) {
        lead_resistance_ohms = LEAD_RESISTANCE_MIN_OHMS;
    }
    if (lead_resistance_ohms > LEAD_RESISTANCE_MAX_OHMS) {
        lead_resistance_ohms = LEAD_RESISTANCE_MAX_OHMS;
    }

    persistent_from_runtime(&g_persistent_settings);
}

static void clampParams(void) {
    if (weld_mode < 1) weld_mode = 1;
    if (weld_mode > 3) weld_mode = 3;

