farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if (weld_d1_ms > MAX_WELD_MS) weld_d1_ms = MAX_WELD_MS;
    if (weld_d2_ms > MAX_WELD_MS) weld_d2_ms = MAX_WELD_MS;
    if (weld_d3_ms > MAX_WELD_MS) weld_d3_ms = MAX_WELD_MS;

    if (weld_power_pct < 50) weld_power_pct = 50;
    if (weld_power_pct > 100) weld_power_pct = 100;

    if (preheat_pct > 100) preheat_pct = 100;
    if (preheat_ms > MAX_WELD_MS) preheat_ms = MAX_WELD_MS;

    if (trigger_mode < 1) trigger_mode = 1;
    if (trigger_mode > 2) trigger_mode = 2;

    if (contact_hold_steps < 1) contact_hold_steps = 1;
    if (contact_hold_steps > 10) contact_hold_steps = 10;

    if (control_mode > 1U) control_mode = 0U;
    if (!isfinite(joule_target_j)) joule_target_j = 50.0f;
    if (joule_target_j < 0.0f) joule_target_j = 0.0f;
    if (joule_target_j > 300.0f) joule_target_j = 300.0f;
}

static void applyArmTimeout(void) {
    if (ARM_TIMEOUT_MS == 0) return;
    if (!armed) return;
    if (armed_until_ms == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - armed_until_ms) >= 0) {
        armed = false;
        armed_until_ms = 0;
        uartSend("EVENT,ARM_TIMEOUT");
    }
}

static void applyReadyTimeout(void) {
    if (!system_ready) return;
    if (READY_TIMEOUT_MS == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - ready_until_ms) >= 0) {
        system_ready = false;
        ready_until_ms = 0;
        uartSend("EVENT,READY_TIMEOUT");
    }
}

static uint16_t pctToDuty(uint8_t pct) {
    float duty_pct;

    // Empirical calibration from measured 50% power data at constant charge
    // level:
    // - duty=723 (70.7%) -> 1502A (~37% of 4033A)
    // - duty=788 (77.0%) -> 2378A (~59% of 4033A)
    // - duty=870 (85.0%) -> 2656A (~66% of 4033A)
    // Target: ~2017A (50% of 4033A)
    // Linear interpolation between duty=723 and duty=788 gives ~duty=761,
    // which is ~74% duty at 50% power. Use piecewise-linear mapping around 74%.
    // Expected duty checkpoints: 25%->379, 50%->757, 75%->890, 100%->1023.
    if (pct == 0U) {
        return 0U;
    } else if (pct <= 50U) {
        // 0-50% power -> 0-74% duty (linear)
        duty_pct = ((float)pct / 50.0f) * 0.74f;
    } else if (pct < 100U) {
        // 50-100% power -> 74-100% duty (linear)
        duty_pct = 0.74f + (((float)pct - 50.0f) / 50.0f) * 0.26f;
    } else {
        duty_pct = 1.0f;
    }

    uint16_t duty = (uint16_t)lroundf(duty_pct * (float)PWM_MAX);

    // Clamp to valid range
    if (duty > PWM_MAX) duty = PWM_MAX;

    return duty;
}

static uint32_t doPulseMsPwm(uint16_t ms, uint16_t duty, uint32_t* pwm_on_us,
                             uint32_t* pwm_off_us,
                             uint16_t* pwm_off_waveform_index) {
    if (ms == 0U) {
        const uint32_t now_us = micros_now();
        if (pwm_on_us != NULL) {
            *pwm_on_us = now_us;
        }
        if (pwm_off_us != NULL) {
            *pwm_off_us = now_us;
        }
        if (pwm_off_waveform_index != NULL) {
            *pwm_off_waveform_index = waveform_index;
        }
        return 0U;
    }
    if (ms > MAX_WELD_MS) ms = MAX_WELD_MS;

    const uint32_t pulse_start_us = micros_now();
    uint32_t duration_us = (uint32_t)ms * 1000U;

    /*
     * ── CRITICAL TIMING SEQUENCE ─────────────────────────────────────────
     *
     * TIM2 must start SIMULTANEOUSLY with FET-on so the scope-measured
     * pulse width equals the configured duration.  Previous code had
     * ~30-80 µs of setup between pwmOn and TIM2 start (float division,
     * variable init, function-call overhead) which the scope saw as
     * overshoot.
     *
     * New sequence:
     *   1. Arm TIM2 (ARR, UIE, one-pulse) — but do NOT start yet
     *   2. Start TIM2 (write CEN)
     *   3. IMMEDIATELY pwmOnDuty()  — ~1 instruction later
     *   4. capturePulseAmpsForDurationUs() just samples ADC; timer is
     *      already running and ISR will kill FET at expiry.
     *
     * Net FET-on-to-TIM2-start skew: ~1 CPU cycle ≈ 6 ns.
     * ─────────────────────────────────────────────────────────────────────
     */
    tim2_fet_killed = false;

    TIM2->CR1 = 0U; /* stop timer              */
    TIM2->CNT = 0U; /* reset counter           */
    TIM2->ARR =
        duration_us > 0U ? (duration_us - 1U) : 0U; /* N µs = ARR+1 ticks     */
    TIM2->SR = 0U;             /* clear flags             */
    TIM2->DIER = TIM_DIER_UIE; /* arm FET-kill interrupt  */

    /* --- TIM2 start + FET on: back-to-back register writes --- */
    TIM2->CR1 = TIM_CR1_CEN | TIM_CR1_OPM; /* GO                     */
    pwmOnDuty(duty);                       /* FET ON ~6 ns later     */

    const uint32_t pulse_on_us = micros_now();
    if (pwm_on_us != NULL) {
        *pwm_on_us = pulse_on_us;
    }
    capturePulseAmpsForDurationUs(duration_us, duty);
    /*
     * FET is already OFF - TIM2_IRQHandler killed it within ~70 ns
     * of timer expiry.  No manual pwmOff() needed here.
     * Belt-and-suspenders: call pwmOff() anyway as a safety net.
     * If the ISR already ran, this is a harmless no-op (CCR already 0).
     */
    pwmOff();
    const uint16_t pulse_off_index = waveform_index;
    const uint32_t pulse_off_us = micros_now();

    if (pwm_off_waveform_index != NULL) {
        *pwm_off_waveform_index = pulse_off_index;
    }
    if (pwm_off_us != NULL) {
        *pwm_off_us = pulse_off_us;
    }

    return (uint32_t)(pulse_off_us - pulse_start_us);
}

static void captureGapMsWithWaveform(uint16_t ms) {
    if (ms == 0U) {
        return;
    }

    if (ms > MAX_WELD_MS) {
        ms = MAX_WELD_MS;
    }

    pwmOff();

    /*
     * Legacy helper retained for compatibility with existing call sites.
     * Gap timing now uses TIM2 one-shot for deterministic delay, matching
     * the hardware-timed pulse duration path.
     */
    tim2_delay_us((uint32_t)ms * 1000U);
}

static void fireRecipe(void) {
    uint32_t now_ms = HAL_GetTick();

    if (now_ms - boot_ms < BOOT_INHIBIT_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,BOOT_INHIBIT,ms=%lu",
                 (unsigned long)(BOOT_INHIBIT_MS - (now_ms - boot_ms)));
        uartSend(buf);
        return;
    }

    applyArmTimeout();
    applyReadyTimeout();

    if (!system_ready) {
        uartSend("DENY,NOT_READY");
        return;
    }

